# <center>Project for Foundations of Computer Science</center>
### <center>University of Milano-Bicocca</center>
<center>Matteo Corona - Costanza Pagnin</center>

### 0. Preliminary steps
### Importing libraries

In [1]:
import pandas as pd
import numpy as np
import ast
import re

### Reading *.csv* files from GitHub Repository

In [2]:
travel=pd.read_csv('https://raw.githubusercontent.com/CoroTheBoss/CS-project/main/dogTravel.csv', index_col=0)
dog=pd.read_csv('https://raw.githubusercontent.com/CoroTheBoss/CS-project/main/dogs.csv')
nst=pd.read_csv('https://raw.githubusercontent.com/CoroTheBoss/CS-project/main/NST-EST2021-POP.csv', header=None)

### 1. Extract all dogs with status that is *not adoptable*

Some values were off by one column so they had to be properly shifted

In [3]:
# Shifting values
dog.loc[dog['status']!='adoptable','status':'accessed'] = dog.loc[dog['status']!='adoptable','status':'accessed'].shift(periods=1, axis="columns")

In [4]:
# Cheching all possible values in status
dog["status"].unique()

array(['adoptable', nan], dtype=object)

Since there are two different values, the NaN values refers to the *not adoptable* dogs

In [5]:
# Replacing NaN values
dog.loc[dog.status != 'adoptable', ['status']] = 'not adoptable'
# Printing the first not adoptable dogs to visualize the data
dog.loc[dog.status != 'adoptable', ['id', 'status']].head()

             id         status
644    41330726  not adoptable
5549   38169117  not adoptable
10888  45833989  not adoptable
11983  45515547  not adoptable
12495  45294115  not adoptable

In [6]:
print("There are", len(dog[dog.status != 'adoptable']) ,"dogs with status that is not adoptable" )

There are 33 dogs with status that is not adoptable

### 2. For each (primary) breed, determine the number of dogs

In [6]:
# Grouping dogs by their primary key and counting them
dog.groupby('breed_primary')['id'].count()

breed_primary
Affenpinscher                         17
Afghan Hound                           4
Airedale Terrier                      19
Akbash                                 3
Akita                                181
                                    ...
Wirehaired Pointing Griffon            1
Wirehaired Terrier                    60
Xoloitzcuintli / Mexican Hairless     11
Yellow Labrador Retriever            158
Yorkshire Terrier                    360
Name: id, Length: 216, dtype: int64

### 3. For each (primary) breed, determine the ratio between the number of dogs of `Mixed Breed` and those not of Mixed Breed. Hint: look at the `secondary_breed`.

In [7]:
breed_tab = dog.groupby(['breed_primary','breed_mixed'])['id'].count()
breed_tab = breed_tab.unstack()
breed_tab.columns = ['not_mixed', 'mixed']
breed_tab[np.isnan(breed_tab)] = 0
breed_tab["not_mixed_%"] = round(100 * breed_tab["not_mixed"] / (breed_tab["mixed"] + breed_tab["not_mixed"]), 1)
breed_tab["mixed_%"] = round(100 * breed_tab["mixed"] / (breed_tab["mixed"] + breed_tab["not_mixed"]), 1)
breed_tab["ratio"] = breed_tab["mixed"] / breed_tab["not_mixed"]
breed_tab

,not_mixed,mixed,not_mixed_%,mixed_%,ratio
breed_primary,,,,,
Affenpinscher,12.0,5.0,70.6,29.4,0.416667
Afghan Hound,0.0,4.0,0.0,100.0,inf
Airedale Terrier,2.0,17.0,10.5,89.5,8.500000
Akbash,1.0,2.0,33.3,66.7,2.000000
Akita,98.0,83.0,54.1,45.9,0.846939
...,...,...,...,...,...
Wirehaired Pointing Griffon,0.0,1.0,0.0,100.0,inf
Wirehaired Terrier,15.0,45.0,25.0,75.0,3.000000
Xoloitzcuintli / Mexican Hairless,6.0,5.0,54.5,45.5,0.833333
Yellow Labrador Retriever,36.0,122.0,22.8,77.2,3.388889
Yorkshire Terrier,157.0,203.0,43.6,56.4,1.292994

### 4. For each (primary) breed, determine the earliest and the latest `posted` timestamp.

In [8]:
dog.posted = pd.to_datetime(dog.posted)
time_tab = dog.groupby('breed_primary')[['posted']].min()
time_tab['postedmin'] = dog.groupby('breed_primary')[['posted']].max()
time_tab.columns = ['erliest_posted_timestamp', 'latest_posted_timestamp']
time_tab

,erliest_posted_timestamp,latest_posted_timestamp
breed_primary,,
Affenpinscher,2012-03-08 10:27:33+00:00,2019-09-14 10:10:51+00:00
Afghan Hound,2017-06-29 23:28:51+00:00,2019-07-27 00:38:48+00:00
Airedale Terrier,2014-06-13 12:59:36+00:00,2019-09-19 18:40:39+00:00
Akbash,2019-07-21 00:35:59+00:00,2019-08-23 17:11:04+00:00
Akita,2012-03-03 09:31:08+00:00,2019-09-20 15:19:57+00:00
...,...,...
Wirehaired Pointing Griffon,2016-06-29 20:03:55+00:00,2016-06-29 20:03:55+00:00
Wirehaired Terrier,2012-11-27 14:07:54+00:00,2019-09-19 22:52:45+00:00
Xoloitzcuintli / Mexican Hairless,2007-02-01 00:00:00+00:00,2019-09-08 11:15:54+00:00
Yellow Labrador Retriever,2010-05-31 00:00:00+00:00,2019-09-20 06:30:27+00:00
Yorkshire Terrier,2012-02-04 17:14:52+00:00,2019-09-20 16:56:38+00:00

### 5. For each state, compute the sex imbalance, that is the difference between male and female dogs. In which state this imbalance is largest?

In [9]:
state_tab = dog.groupby(['contact_state','sex'])['id'].count()
state_tab = state_tab.unstack()
state_tab[np.isnan(state_tab)] = 0
state_tab["sex_imbalance"] = state_tab["Male"] - state_tab["Female"]
state_tab.head()

sex            Female    Male  Unknown  sex_imbalance
contact_state
AK                7.0     8.0      0.0            1.0
AL              716.0   712.0      0.0           -4.0
AR              351.0   344.0      0.0           -7.0
AZ             1067.0  1181.0      1.0          114.0
CA              777.0   887.0      0.0          110.0

In [10]:
print("The state with the highest sex imbalance is Ohio.")
state_tab.loc[state_tab["sex_imbalance"] == state_tab["sex_imbalance"].max()]

The state with the highest sex imbalance is Ohio.

sex            Female    Male  Unknown  sex_imbalance
contact_state
OH             1234.0  1439.0      0.0          205.0

### 6. For each pair (age, size), determine the average duration of the stay and the average cost of stay.

In [11]:
round(dog.groupby(['age','size'])[['stay_duration','stay_cost']].mean(), 2)

                    stay_duration  stay_cost
age    size
Adult  Extra Large          89.02     232.59
       Large                89.53     238.66
       Medium               89.42     238.26
       Small                89.41     238.97
Baby   Extra Large          87.03     237.18
       Large                89.70     238.70
       Medium               89.58     237.11
       Small                89.96     239.08
Senior Extra Large          88.86     235.23
       Large                88.98     237.51
       Medium               89.81     238.51
       Small                89.07     238.28
Young  Extra Large          90.59     245.84
       Large                90.10     238.15
       Medium               89.52     239.30
       Small                89.81     241.54

### 7. Find the dogs involved in at least 3 travels. Also list the breed of those dogs.

In [12]:
travel_tab = travel.groupby(['id'], as_index=False)[['contact_city']].count()
travel_tab.columns = ["id", "count"]
travel_tab_3 = travel_tab[travel_tab["count"] > 2]
pd.merge(travel_tab_3,dog[["id", "breed_primary", "breed_secondary", "breed_mixed", "breed_unknown"]],
         how='left', on=["id"])

,id,count,breed_primary,breed_secondary,breed_mixed,breed_unknown
0,16657005,4,Pit Bull Terrier,NaN,True,False
1,20905974,5,Chow Chow,English Springer Spaniel,True,False
2,24894870,4,Hound,Terrier,True,False
3,24894894,4,Hound,Terrier,True,False
4,33218331,7,Alaskan Malamute,Siberian Husky,True,False
...,...,...,...,...,...,...
558,46042569,3,Labrador Retriever,NaN,False,False
559,46042587,3,Labrador Retriever,NaN,False,False
560,46042618,3,Labrador Retriever,NaN,False,False
561,46043099,3,Labrador Retriever,NaN,False,False
562,46043149,3,Labrador Retriever,NaN,False,False

In [13]:
print("There are", len(travel_tab_3) ,"dogs involved in at least three travels" )

There are 563 dogs involved in at least three travels

### 8. Fix the `travels` table so that the correct state is computed from  the `manual` and the `found` fields. If `manual` is not missing, then it overrides what is stored in `found`.

In [14]:
i = 0
for elem in travel["manual"]:
    if pd.isnull(elem) == False:
        travel["found"].values[i] = elem
    i = i + 1
travel

,id,contact_city,contact_state,description,found,manual,remove,still_there
index,,,,,,,,
0,44520267,Anoka,MN,Boris is a handsome mini schnauzer who made hi...,Arkansas,NaN,NaN,NaN
1,44698509,Groveland,FL,Duke is an almost 2 year old Potcake from Abac...,Bahamas,Bahamas,NaN,NaN
2,45983838,Adamstown,MD,Zac Woof-ron is a heartthrob movie star lookin...,Maryland,Maryland,NaN,NaN
3,44475904,Saint Cloud,MN,~~Came in to the shelter as a transfer from an...,Adaptil,NaN,True,NaN
4,43877389,Pueblo,CO,Palang is such a sweetheart. She loves her peo...,Afghanistan,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
6189,40492179,Fairmont,WV,Please contact Pet (information@pethelpersinc....,WV,NaN,True,NaN
6190,45799729,Eagle Mountain,UT,Shiny is an approximately 4-6-year-old spayed ...,Wyoming,NaN,NaN,NaN
6191,34276515,Newnan,GA,Yanni is a Male Great Pyrenees that we rescue...,Yazmin,NaN,True,NaN
6192,44519341,Dayton,OH,Callie is a 14 year old Chihuahua whose owner ...,Ohio,Ohio,NaN,NaN
6193,36659999,New York,NY,This guy loves to be outside so a person w/ a ...,Zazu,NaN,True,NaN

### 9. For each state, compute the ratio between the number of travels and the population.

In [15]:
# Fixing a value in travels: 17325 refers to Pennsylvania (PA)
travel["contact_state"] = travel["contact_state"].replace('17325','PA')
# Opening and reading the file (found on the internet) which contains the state abbreviations
file = open("abbreviations.txt", "r")
contents = file.read()
# Converting the file into a dictionary
abb = ast.literal_eval(contents)
file.close()
# Naming nst columns (the file was without header)
nst.columns = ["state", "population"]
# Substituting state names with abbreviations
nst = nst.replace({"state": abb})
# Converting population column into numeric values
nst["population"] = nst["population"].str.replace('.', '', regex=True)
nst.head()

  state population
0    AL    5024279
1    AK     733391
2    AZ    7151502
3    AR    3011524
4    CA   39538223

In [15]:
state_tab_2 = travel.groupby(['contact_state'], as_index=False)['id'].count()
state_tab_2.columns = ["state", "travels"]
state_tab_2 = pd.merge(nst,state_tab_2[["state","travels"]],
         how='left', on=["state"])
state_tab_2 = state_tab_2.fillna(0)
state_tab_2["population"] = state_tab_2["population"].astype(float)
state_tab_2["ratio"] = state_tab_2["travels"] / state_tab_2["population"]
state_tab_2.head()

  state  population  travels         ratio
0    AL   5024279.0     75.0  1.492751e-05
1    AK    733391.0      0.0  0.000000e+00
2    AZ   7151502.0     70.0  9.788154e-06
3    AR   3011524.0     10.0  3.320578e-06
4    CA  39538223.0     28.0  7.081755e-07

### 10. For each dog, compute the number of days from the `posted` day to the day of last access.

In [16]:
import warnings
warnings.filterwarnings('ignore')
time_tab_2 = dog[["id","posted", "accessed"]]
time_tab_2.accessed = pd.to_datetime(time_tab_2.accessed).dt.date
time_tab_2.posted = pd.to_datetime(time_tab_2.posted).dt.date
time_tab_2["days"] = time_tab_2["accessed"] - time_tab_2["posted"]
time_tab_2

             id      posted    accessed     days
0      46042150  2019-09-20  2019-09-20   0 days
1      46042002  2019-09-20  2019-09-20   0 days
2      46040898  2019-09-20  2019-09-20   0 days
3      46039877  2019-09-20  2019-09-20   0 days
4      46039306  2019-09-20  2019-09-20   0 days
...         ...         ...         ...      ...
58175  44605893  2019-05-03  2019-09-20 140 days
58176  44457061  2019-04-13  2019-09-20 160 days
58177  42865848  2018-09-27  2019-09-20 358 days
58178  42734734  2018-09-12  2019-09-20 373 days
58179  42663515  2018-09-03  2019-09-20 382 days

[58180 rows x 4 columns]

### 11. Partition the dogs according to the number of weeks from the `posted` day to the day of last access.

In [21]:
time_tab_3 = dog[["id","posted", "accessed"]]
time_tab_3.accessed = pd.to_datetime(time_tab_3.accessed).dt.date
time_tab_3.posted = pd.to_datetime(time_tab_3.posted).dt.date
time_tab_3["weeks"] = round((time_tab_3["accessed"] - time_tab_3["posted"])/np.timedelta64(1,'W'),0)
time_tab_3 = time_tab_3.groupby(["weeks"])[['id']].agg(lambda x: list(x))
time_tab_3

                                                      id
weeks
0.0    [46042150, 46042002, 46040898, 46039877, 46039...
1.0    [45989641, 45988823, 45988816, 45988814, 45987...
2.0    [45919405, 45917309, 45917305, 45917298, 45911...
3.0    [45841113, 45841108, 45841101, 45841088, 45841...
4.0    [45751169, 45748689, 45748573, 45748545, 45748...
...                                                  ...
730.0                                          [5142790]
747.0                                          [4527948]
812.0                                          [2613506]
813.0                                          [2592031]
853.0                                           [604115]

[579 rows x 1 columns]

### 12. Find for duplicates in the `dogs` dataset. Two records are duplicates if they have (1) same breeds and sex, and (2) they share at least 90% of the words in the description field. Extra points if you find and implement a more refined for determining if two rows are duplicates.

Since we are working on the description, let's remove the data which has a NaN value in the description attribute.

In [25]:
# Removing data with NaN description
dog_2 = dog[pd.notnull(dog["description"])]
# Grouping by breed and sex
dog_2 = dog_2.groupby(["breed_primary", "sex"])[["id", "description"]].agg(lambda x: list(x))
dog_2

                                                                                         id  \
breed_primary                     sex
Affenpinscher                     Female  [45889013, 22427951, 45970614, 45871731, 45916...
                                  Male    [38985146, 45728674, 45787432, 45858286, 45362...
Afghan Hound                      Female                                         [38623654]
                                  Male                       [45382284, 42476375, 39728532]
Airedale Terrier                  Female  [45682240, 45811667, 45295124, 43692266, 46007...
...                                                                                     ...
Xoloitzcuintli / Mexican Hairless Male    [44118935, 43283678, 43248772, 45905447, 44869...
Yellow Labrador Retriever         Female  [43828473, 39983699, 28672284, 44927114, 46006...
                                  Male    [46031975, 45987630, 45592988, 45288980, 39528...
Yorkshire Terrier                 Female  [45908725, 45272327, 44618549, 45310965, 45609...
                                  Male    [45892741, 45666935, 44070750, 43357850, 45950...

                                                                                description
breed_primary                     sex
Affenpinscher                     Female  [This cutie is very sweet. She is a little shy...
                                  Male    [Ralphie is a darling black Affenpinscher mix ...
Afghan Hound                      Female  [Nosey is available January 2018 after heartwo...
                                  Male    [We do not know what breed Bear is. He resembl...
Airedale Terrier                  Female  [Meet Cher! She is a very sweet puppy needing ...
...                                                                                     ...
Xoloitzcuintli / Mexican Hairless Male    [Vlad is one of our sanctuary dogs.  He is a M...
Yellow Labrador Retriever         Female  [We've had Goldie for almost 5 years, and she ...
                                  Male    [Ranger is a sweet boy full of puppy energy an...
Yorkshire Terrier                 Female  [Meet Lucy!  Lucy is a 10 month old Carin Terr...
                                  Male    [Maverick is a very playful Yorkie that does n...

[403 rows x 2 columns]